#### StructuralBehavior Enumeration

---

|  |
| --- |
| See Also |

Specifies whether structural elements behave orthotropically, isotropically, or transverse-isotropically.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2012
  **Since:**  2012

# Syntax

| C# |
| --- |
| ``` public enum StructuralBehavior ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration StructuralBehavior ``` |

| Visual C++ |
| --- |
| ``` public enum class StructuralBehavior ``` |

# Members

| Member name | Description |
| --- | --- |
| Isotropic | The structural element behaves isotropically. |
| Orthotropic | The structural element behaves orthotropically. |
| TransverseIsotropic | The structural element behaves transverse-isotropically. |

# See Also

Autodesk.Revit.DB Namespace